Revit 2027 API
BaseExportOptions.LayerMapping Property
 Name of a layer settings standard or filename (with custom layer settings). Valid standards are: DGNV7 (only for DGN), AIA, CP83, BS1192, and ISO13567. default value is "" (empty) which means if no value is set, if no value is set, Revit will use a default value according to the localization.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string LayerMapping { get; set; }
Public Property LayerMapping As String
	Get
	Set
public:
property String^ LayerMapping {
	String^ get ();
	void set (String^ value);
}
member LayerMapping : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
BaseExportOptions Class
Autodesk.Revit.DB Namespace